---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetColoredSurfaceSettings
source: html/9d153cac-e6d9-ef6d-d123-694099ef2ef6.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.GetColoredSurfaceSettings Method

Get colored surface settings object from the style.

## Syntax (C#)
```csharp
public AnalysisDisplayColoredSurfaceSettings GetColoredSurfaceSettings()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - colored surface settings were not created with the object.